package lesson11;

public class Task2 {
    public static void main(String[] args) {
/*      Задача 2
        Написать программу со следующим функционалом:
        Считывание 20 чисел с клавиатуры,
                сохранение их в список,
                сортировка по трём другим спискам:
        число нацело делится на 3,
                нацело делится на 2 и
        все остальные.
        Числа, которые делятся на 3 и на 2 одновременно, например 6, попадают в оба списка.
            Метод printList() должен выводить на экран все элементы всех списков с новой строки.
            Метод printList(String listName) должен выводить на экран все элементы указанного списка*/

    }
}
